[
    {
        "name": "Ascott Jakarta",
        "address": "Jl. Kebon Kacang Raya No 2, Thamrin, Jakarta, Indonesia, 10230",
        "handleCovid": false,
        "city": "Jakarta",
        "category": "hotel",
        "source": "agoda",
        "photos": [
            "https://pix8.agoda.net/hotelImages/4863262/0/78c66ba6afe8d038d36604b0a1667096.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/108582/0/1d8953fe63bed1fc4216724b63899614.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/108582/0/fdba2a2c4e798039b4c0848411383507.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/108582/0/ffb1df3822b966028d06d3734faa0971.jpg?s=1024x768"
        ],
        "averageRating": 4.3,
        "ota": [
            {
                "price": 1052788,
                "provider": "agoda",
                "link": "https://www.agoda.com/id-id/ascott-jakarta/hotel/jakarta-id.html"
            }
        ],
        "reviews": [
            {
                "comment": "It was the first time that The Husband and I travelled to Jakarta free and easy, without the help of guides. We were pleasantly surprised to discover the close proximity this hotel is to major shopping belts. To the left would be Thamrin City and to the right would be Grand Indonesia Shopping Town. \n\nUpon arrival at the airport, their airport transfer staff was there to bring us to the hotel. Upon registration, we were allowed to check-in immediately, even though it was only 11am and official check-in time wasn't until 2pm. \n\nNeedless to say, we kept ourselves fully occupied with lots of shopping at the malls within that area. Dining choices were plenty. From Restoran Sederhana across from Thamrin City that sold delicious padang food, to foodcourts in Thamrin City for refresher meals in between shopping. \n\nDinner would be a more relaxed affair over at Grand Indonesia Shopping Town. Again, spoilt for choice because they had more than 4 floors of food outlets accumulatively. From high end restaurants to foodcourts to suit your budget. \n\nEach time we returned to the hotel, we were greeted by warm smiles. On our last day, our scheduled pickup to the airport was at 230pm. We check with this staff if this meant we had to check-out at 12pm like with most hotels and leave our bags at the lobby while we spend the time away until 230pm, but they were nice enough to say that the room would be ours until the scheduled pick-up time. \n\nSo Ascott Jakarta, we will be back. With friends and family in tow :)",
                "name": "Nurazreen",
                "source": "agoda",
                "reviewDate": "2014-06-03T17:00:00.000Z"
            },
            {
                "comment": "Made a reservation for 3 nights stay with my family, 2 kids age 4 and 11. \nNormally, we will stay at  Ciputra Hotel but this time round we wanted to be near the shopping centre name Thamrin City. Never did I realised that the Ascott Jakarta was a perfect selection. \n\nOn the left to the hotel, is Thamrin city Shopping Mall, to the right will be Grand Indonesia shopping town. \n\nWhat more do you want? It was a fantastic, awesome and wonderful holiday. \nTo top it up, we got a complimentary upgrade to a 2 bedroom Premier from 1 bedroom. So lucky. \nTo add to the excitement, we went to watch a wonderful movie GOLD CLASS seat at only 80 000 rupiah per seat.And it's just next door, walking distance to Grand Indonesia Shopping Town. You can find Breadtalk, Kenny Rodgers, Fish & Co all these at the basement one. \n\nFrom hotel to Kidzania Jakarta is just around 15-20 minutes drive only, depending on the traffic condition. \n\nOverall, it was such a pleasant and wonderful family  holiday. Because of all these pleasant experiences, we extend our stay for another night. \n\nHave a wonderful holiday everyone!!! ",
                "name": "Muhd",
                "source": "agoda",
                "reviewDate": "2015-06-19T17:00:00.000Z"
            },
            {
                "comment": "Got a good deal on Agoda for my recent 4D3N trip to Jakarta and it was a great experience from check-in to check-out. Unrivalled location with Grand Indonesia, Thamrin City and Plaza Indonesia right at the doorstep! \n\nPak Ali (Hambali) catered to our request for early check-in and late check-out, and is definitely one of the gems at Ascott Jakarta (besides location, aesthetics, cleanliness) as he really went out of his way to make sure our stay went perfectly well and that we leave with good memories. Will definitely return to Ascott Jakarta the next time I travel there!",
                "name": "Nur",
                "source": "agoda",
                "reviewDate": "2018-01-29T17:00:00.000Z"
            },
            {
                "comment": "I really have the best stay during my anniversary trip to Jakarta! The room is spacious, complete with basic amenities that a house should have i.e. water dispenser, fridge, cooking utensil and even a washing machine that comes with a dryer! The staff is very friendly n helpful. the location is really2 great. walking distance to Thamrin City, Grand Indo & the Plaza. We even walked to Tanah Abang (1.2km) which takes about 12mins, rather than taking grab which takes about 24 mins due to 'macet'. dont get surprised as we also walked from BNI station to the hotel. We dont feel its far as we enjoyed exploring the city, seeing people selling food at the street. Return to Ascott Jakarta? - Definitely, yes!",
                "name": "NOR",
                "source": "agoda",
                "reviewDate": "2019-01-30T17:00:00.000Z"
            },
            {
                "comment": "As usual, enjoyed our stay at Ascott Jakarta. Don't think The Husband and I will ever consider other hotels each time we visit Jakarta because Ascott has the best location. Exit to the left will be Thamrin City and exit to the right opens up an entire exploration of Grand Indonesia Mall (the food F&B options are ENDLESS!) and Plaza Indonesia. We have been to Jakarta countless of times and each time, Ascott will be our choice. It helps that staffs are conversant in English too. They are always happy to tend to our queries. See you guys in a few months' time!",
                "name": "Nurazreen",
                "source": "agoda",
                "reviewDate": "2018-03-28T17:00:00.000Z"
            }
        ],
        "reviewSummary": [
            "Great location",
            "Comfortable room",
            "Friendly staffs that speak English",
            "Clean and tidy hotel"
        ]
    },
    {
        "name": "Century Park Hotel",
        "address": "Jl. Pintu Satu, Senayan, Jakarta, Indonesia, 10270",
        "handleCovid": false,
        "city": "Jakarta",
        "category": "hotel",
        "source": "agoda",
        "photos": [
            "https://pix8.agoda.net/hotelImages/9076/-1/ee7b18a254bd25759b65c4fb3e01c0da.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/907/9076/9076_14050213560019284490.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/907/9076/9076_18101020150068419891.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/9076/-1/596560a30ab104f38fb33956ec59025d.jpg?s=1024x768"
        ],
        "averageRating": 4,
        "ota": [
            {
                "price": 477857,
                "provider": "agoda",
                "link": "https://www.agoda.com/id-id/century-park-hotel/hotel/jakarta-id.html"
            }
        ],
        "reviews": [
            {
                "comment": "I used to live in Jakarta and so am quite familiar with most of the \"international\" (meaning Hyatt, Sheraton, Mandarin, Shangrila, etc.;  mostly five star) as well as \"near international\" (meaning Aryaduta, Borobudur, Century Park, etc.) hotels.  This hotel is located in Senayan right next to the Jakarta stadium (Gelora Bung Karno), and is well located on the South side of Jakarta.  The guests are upscale, mostly Indonesian, although it is a funny mix of sports teams staying there during competitions (hence its full Indonesian name Atlet Century Park Senayan) and people visiting nearby ministries (particularly the ministry of education), plus business people.  The rack rates seem high, but they have lower corporate rates and they also discount regularly via services like Agoda, at which point the prices are reasonable.  If you are a business person looking for an acceptable but relatively inexpensive hotel, the Century Park is fine, and if you are the kind of business traveller who wants to exercise/run it is probably a good place to go because of the sports complex literally across the street.  It has acceptable food in terms of a café, but if you want expensive hotel restaurants and the like you might do better at someplace like the Mandarin or Hyatt.  But the most important aspect of any hotel in Jakarta is location because of the traffic, so this hotel is good for meetings from the Central Business District around the Stock Exchange down to South Jakarta.  It is also cheap enough for families, if you look for the online discounted room, etc.  I will stay there again.",
                "name": "David",
                "source": "agoda",
                "reviewDate": "2015-10-30T17:00:00.000Z"
            },
            {
                "comment": "The main reason we stayed at Century Park Hotel is because we were going to a concert in Istora Senayan which is right in front of the hotel. We could even see the gate from our room, definitely the place to stay if u're attending an event in Istora.\nThe location is also perfect because it is walking distance to Senayan MRT station and Istora MRT station.\nThere are a few malls nearby; FX Sudirman (less than 5mins walk), Senayan Plaza and Senayan City (around 10-15mins walk), and Pacific Place is also walking distance (around 15-20mins walk). If you don't prefer to walk or use public transport, there are lots of taxis and Gojek motorcycles near the hotel.\nChoices during buffet breakfast is quite good (especially if u want to try local food), staffs are friendly and always ready to help.\nThere's a Maybank ATM machine in the hotel lobby if you need extra cash.\n\nI would definitely recommend this hotel and would stay here if we come to Jakarta again.",
                "name": "Khairulbariyah",
                "source": "agoda",
                "reviewDate": "2019-08-30T17:00:00.000Z"
            },
            {
                "comment": "I stayed for 4 nights at the Century Park hotel. The Executive room was large, very clean and well appointed. Shower was excellent and good bathroom amenities. Room included fantastic views of the Jakarta skyline. The Executive Lounge provided excellent breakfast and evening drinks/snacks. Staff performance throughout was fantastic and professional.\r\n\r\nLocation was central and very close to Senayan Plaza and City for a broad selection of shopping, eating and nightlife.\r\n\r\nOverall, I would highly recommend this hotel.\r\n",
                "name": "Colin",
                "source": "agoda",
                "reviewDate": "2013-04-10T17:00:00.000Z"
            },
            {
                "comment": "My stay at the Century Park Hotel was entirely satisfying. The staff was friendly and capable. There were some additional perks for long-staying guests, such as vouchers for massage. The location of the hotel is excellent, at walking distance of Plaza Senayan and Senayan City shopping malls. Good availability of taxis at the hotel and close to public transport (Trans Jakarta busline).",
                "name": "Herman",
                "source": "agoda",
                "reviewDate": "2013-06-25T17:00:00.000Z"
            },
            {
                "comment": "Atlet Century Park was recommended to me by a friend who lives in Jakarta, this recommendation was justified. This is a good four-star quality hotel.\r\n\r\nThe lobby is welcoming, the rooms are excellent. I booked a deluxe as it includes free internet (2 hours/day). It was clean and large and with decent views from both sides of the hotel. The bathroom was excellent.\r\n\r\nBreakfast (included) is a decent hotel buffet-style with Indonesian, Japanese and Western influences. The restaurant (Semayan) is also a decent option for other meals. The lobby coffee shop is also pleasant for coffee and afternoon cocktails.\r\n\r\nThe pool is basic but nice to use, probably better for keeping up your laps than as a pleasure facility.\r\n\r\nTransport - Blue Bird Taxis are available in the lobby but if you prefer local transport the TransJakarta busway is 100m away. As they have a dedicated bus lane the busway can be faster than taxis for certain trips at certain times of the day. The hotel is located close to the places you are likely to want to visit in Jakarta.\r\n\r\nI stayed here with my (same-sex) male partner and found the staff friendly and without problems dealing with gay guests.\r\n\r\nOverall, this is good value for money and I will happily stay here again.",
                "name": "Jeremy",
                "source": "agoda",
                "reviewDate": "2010-02-05T17:00:00.000Z"
            }
        ],
        "reviewSummary": [
            "Good location",
            "Nice hotel with good facilities",
            "Good breakfast and restaurant",
            "Friendly staffs that can deal with gay guests"
        ]
    },
    {
        "name": "Erian Hotel",
        "address": "Jalan K.H Wahid Hasyim 45, Thamrin, Menteng, Jakarta, Indonesia, 10350",
        "handleCovid": false,
        "city": "Jakarta",
        "category": "hotel",
        "source": "agoda",
        "photos": [
            "https://pix8.agoda.net/hotelImages/5034157/-1/7b4eebd5daf0e14cefaac0c6e8288960.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/5034157/-1/1b9318f27048d2f926f021b430109475.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/5034157/-1/f85ca0c0770041255f76644823f01a8b.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/5034157/-1/3ae9cf8aee99cdf7109eb6eac001d9d0.jpg?s=1024x768"
        ],
        "averageRating": 4.6,
        "ota": [
            {
                "price": 280046,
                "provider": "agoda",
                "link": "https://www.agoda.com/id-id/erian-hotel/hotel/jakarta-id.html"
            }
        ],
        "reviews": [
            {
                "comment": "ERIAN Hotel shines bright in the murky (figuratively) Wahid Hasyim Street. This street and its neighboring tourist village have long been famous for their budget accommodation in the heart of Jakarta. Recently upscale properties are present there as business and demand for decent hotels grow fast. The lucrative market and steep competition forced hotelliers to provide better rooms at competitive rates. Refurbishment has been the daily view in the past 10 years. However, some players are still playing tricky strategies to attract guests. Most of the times advertisements are beyond reality and better physical appearances don't come with hospitality. Those are not the case of ERIAN Hotel.\n\nWarm greetings and smiling faces are everywhere in this place. You could feel sincerity even if those gestures could be results of trainings.\n\nWith this limited space he owns (I sense masculinity in the design), the owner of ERIAN decided to provide spacious rooms. Even a koi pond is set next to its entrance. It takes a BIG heart to do so in this area. The hotel and rooms design is simple, chic, and elegant. I love the rustic finishing of the table.\n\nThis is a 3-star hotel with a 4-star breakfast and a 5-star hospitality. \n\nPLUS:  Everything. Fresh air in lobby, clean and neat rooms, comfortable bed and pillows, excellent wifi, etc.\n\n\nSUGGESTION: \n- As it is the same case for almost all hotels in the area, you need to let go smelly first minute water when you get in rooms.\n\n- One of the two security guards at night should lower his voice. No need to yell when ordering something to his colleague. This is just my personal preference.\n- The clumsy boy at the restaurant needs to wear boots instead of sandals because his walk is wrong for a server. I hate the sound of lazy sandals dragged on the floor.\n\nI will surely stay here again anytime soon.",
                "name": "ANDERONIKUS",
                "source": "agoda",
                "reviewDate": "2019-12-21T17:00:00.000Z"
            },
            {
                "comment": "There was a time when I used to frequent Jalan Jaksa and I thought I'd look for a hotel in the neighbourhood as I only planned to stopover for just a night in Jakarta. I picked Erian as it had good ratings on Agoda. No regrets and I am returning them ratings 5x5 stars. My only regret was that i did not stay longer. The hotel is on Jalan Wahid Hashyim. The stretch of Wahid Hasyim from Erian to Sarinah had gone through some kind of transformation into a clean, safe stretch of road. I walked all the way to Plaza Indonesia/Grand Indonesia and back. Along the way were a lot of food places at night. Jalan Jaksa is slowly losing its image as a backpackers place as there are ongoing construction works which may add new glittering facade to the street. Apart from the good location, the hotel itself is clean and new. They do cater for the modern traveller with powerpoints for charging your phone and gadgets near the bed. ll definitely be back",
                "name": "Nelson",
                "source": "agoda",
                "reviewDate": "2019-01-13T17:00:00.000Z"
            },
            {
                "comment": "I would strongly recommend Erian Hotel to any traveller. The hotel is in a convenient location to get anywhere. The hotel and the rooms are clean. The breakfast was fantastic and so was room service. We tried both western and indonesian cuisine and they were all delicious! The staff were all friendly and nice. They helped us cut the fruit we brought from a vendor and heat up our snacks. It was such a pleasant stay for us that we would definitely come backto stay when we are in Jakarta again!",
                "name": "Deborah",
                "source": "agoda",
                "reviewDate": "2019-11-19T17:00:00.000Z"
            },
            {
                "comment": "Definitely on my top list whenever I need a quiet place to stay near the city center! My experience was well worth the money and I'd definitely stay here again.\n\nSome things that stood out to me: the atmosphere, modern simple-yet-significant interior, well designed details (like how cool the light switch and cloth hook is), service (how they provide refillable water jug instead of single use plastic bottles), thick walls (it might be the location of my room? But I didn't hear any sound from next door neighbors), and the fun rooftop bar enriched my stay at Erian Hotel.\n\nMy only problem was with the provided information on this app though, the photos don't represent how spacious the room & bathroom at my Family Room are, so it might mislead lurking guests.\n\nAlso shout out to Mr. M. Raudy at the front desk for the warm pleasantries and the tremendous help during my stay!",
                "name": "Prisilia",
                "source": "agoda",
                "reviewDate": "2020-11-09T17:00:00.000Z"
            },
            {
                "comment": "I had a good time staying at Erian Hotel. Centrally located in the center of the city where you can visit Bundaran HI and charming Menteng neighborhood just by walking distance. The room is spacious and squeaky clean, and you can also have an evening chill out at the bar in the rooftop with stunning views of Jakarta's skyline. ",
                "name": "adhit",
                "source": "agoda",
                "reviewDate": "2020-10-26T17:00:00.000Z"
            }
        ],
        "reviewSummary": [
            "Centrally located in the center of the city",
            "Spacious and clean room",
            "Good breakfast and evening chill out at the bar in the rooftop with stunning views of Jakarta's skyline."
        ]
    },
    {
        "name": "Hotel Indonesia Kempinski Jakarta",
        "address": "Jl. MH Thamrin No. 1, Thamrin, Jakarta, Indonesia, 10310",
        "handleCovid": false,
        "city": "Jakarta",
        "category": "hotel",
        "source": "agoda",
        "photos": [
            "https://pix8.agoda.net/hotelImages/148721/-1/5b2e588e36c9a0e47c796ada1c51ce92.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/148/148721/148721_19061117510075710524.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/5080157/78160477/240e230439b40d9909eb5cf95c82302f.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/148721/-1/390e86838e9ad1474ad9fccd8d255bc9.jpg?s=1024x768"
        ],
        "averageRating": 4.5,
        "ota": [
            {
                "price": 1793289,
                "provider": "agoda",
                "link": "https://www.agoda.com/hotel-indonesia-kempinski-jakarta/hotel/jakarta-id.html"
            }
        ],
        "reviews": [
            {
                "comment": "this hotel is one of the best hotels in jakarta. i have been traveling to jakarta  for  more than 2 decades.since the hotel finished its renovation, i have been staying at this hotel most of the time. great hotel, facilities and staff are very professional. shopping is also very convenient. at grand indonesia there are lots of good shops. they won't disappoint you.\r\n\r\nfor souvenirs go to alun-alun at grand indonesia or go to plaza indonesia to find some more batiks at bin house, batik keris,  iwan tirta private collection, alleira batik or lennor.\r\n\r\nfor restaurants:\r\nskye bar and restaurant (take the lift near gramedia book store at grand indonesia)\r\ngood to see the view of jakarta\r\nmenara bca, lt. 56, jl. m. h. thamrin no. 1, thamrin\r\n\r\ncold stone icecream\r\ncrystal jade palace (dim sum)\r\nthe grand duck king (chinese food)\r\nkafe betawi (indonesian food)\r\nsushi tei (japanese food)\r\nsocial house (soho) \r\na lounge cum café and bar with beautiful view of hotel indonesia round about.\r\npizza & pasta, sushi, eastern & western\r\ngrand indonesia, east mall, 1st fl\r\njalan m.h. thamrin no 1\r\njakarta pusat, indonesia\r\n",
                "name": "Novie",
                "source": "agoda",
                "reviewDate": "2013-11-04T17:00:00.000Z"
            },
            {
                "comment": "Fantastic stay at Hotel Indonesia Kempinski! Even though it was my first visit ever to Jakarta, together with the choatic scene which it owned, the hotel itself is like a mini oasis of its own. It is connected to the Grand Indonesia, which is only a road opposite to the Plaza Indonesia (being the 2 most luxurious shopping malls in the whole of Jakarta). The hotel room was completedly out of the blue. I requested for a room at the highest floor available so I can clearly look towards Bundaran HI (being the welcome monument of Jakarta). That was well delivered. The bathroom was huge and also overlooking the monument! Bedroom was fantastic, with a small living room styled area with sofas to chill. As for the malls, you will definitely get lost in. Don't ever get put off by the thought of Jakarta being undeveloped and poorly planned, it is definitely well worth the trip to get there and take a look. I will definitely be back and with Kempinski again!",
                "name": "Janet",
                "source": "agoda",
                "reviewDate": "2013-05-21T17:00:00.000Z"
            },
            {
                "comment": "we had a fantastic stay at hotel indonesia kempinski jakarta.  the room is beautifully decorated with a king bed.  free wifi and internet access is also available.  the bathroom is awesome with a separate tub that overlooks to the bedroom.  separate cubicle for the shower and the toilet.  the toilet has a sensor that automatically opens the toilet seat cover as you enter and flushes then closes as you get out.  we were escorted by a friendly and polite staff to our room upon check in, then the luggage came almost instantly.  we're smokers, so, we asked for a smoking room and were surprised to be given a smoking room which smelled good.  the hotel is perfectly located with access to the grand indonesia mall.  we had breakfast at the signature cafe.  they had a complete spread in the buffet - dimsum, indonesian, pancakes, croissants and pastries and breads.  value for money hotel!",
                "name": "Mario",
                "source": "agoda",
                "reviewDate": "2012-05-13T17:00:00.000Z"
            },
            {
                "comment": "Kempinski Indonesia is one of the top notch hotel here in Jakarta. If you are looking for one on the finest stay and also in the centralise area, this hotel is fully recommended. We book the grand deluxe room through agoda.com. The room is super spacious and my kids really love it and they can play in such a huge room. The toilet have a separated bath and also a jacuzzi bath tub with a tv in it. \n\nThe hotel is located right beside the grand Indonesia mall and there is a direct corridor from the hotel that links to the mall. The mall is also a one stop shopping area where you can get anything from fashion designs to international food variety. There is also kids entertainment area located at the east mall. \n\nHotel facilities like the spa, Gym, swimming pool, sauna and steam bath was also very good. All are located on the 17th floor with a spectacular view of the city. Overall a great stay and its recommended for you to stay.",
                "name": "MOHAMAD",
                "source": "agoda",
                "reviewDate": "2017-12-10T17:00:00.000Z"
            },
            {
                "comment": "Stayed at the Hotel Indonesia Kempinski Jakarta for 5 days. We chose the location because it had direct access to the Grand Indonesia mall which was very important for us. They took the initiative of setting up a baby cot for my 2 year old which was immensely helpful for my wife and me. We requested several things which they accommodated to us. Room service was prompt. I had sent a few things over before reaching and they were kind enough to hold on to it. Very helpful staff. Would stay again if I have the chance.",
                "name": "Handy",
                "source": "agoda",
                "reviewDate": "2014-10-23T17:00:00.000Z"
            }
        ],
        "reviewSummary": [
            "Great location",
            "Helpful staffs",
            "Spacious and comfortable room",
            "Good food and beverage"
        ]
    },
    {
        "name": "Sawana Suites",
        "address": "Jalan Danau Limboto Blok B1 No. 45, Bendungan Hilir, Tanah Abang, Jakarta Pusat, Senayan, Jakarta, Indonesia, 10210",
        "handleCovid": false,
        "city": "Jakarta",
        "category": "hotel",
        "source": "agoda",
        "photos": [
            "https://pix8.agoda.net/hotelImages/117/1171089/1171089_17040904440052233464.jpg?s=1024x768",
            "https://pix8.agoda.net/hotelImages/117/1171089/1171089_17040904440052233457.jpg?s=1024x768",
            "https://q-xx.bstatic.com/xdata/images/hotel/840x460/96675455.jpg?k=d80b5d498aa660029d493bbf3c1b673f35ba863887f4c429b6071b6949c43dd8&o=",
            "https://pix8.agoda.net/hotelImages/117/1171089/1171089_16042811140041882628.jpg?s=1024x768"
        ],
        "averageRating": 4.1,
        "ota": [
            {
                "price": 274824,
                "provider": "agoda",
                "link": "https://www.agoda.com/id-id/sawana-suites/hotel/jakarta-id.html"
            }
        ],
        "reviews": [
            {
                "comment": "The Hotel Room is very comfortable and the all staff are friendly. my kids are very enjoying to stay at this hotel. the facilities also good but unfortunately in the swimming pool, i didnt see any chair to sit and put all my stuff.  \nwhen the night comes, you can see a beautiful view and cozy place at the roof top (upstair cafe), especially for a couple to chillin and drinking some beer. \nbut overall this hotel very recommended ",
                "name": "ChiqxaNya",
                "source": "agoda",
                "reviewDate": "2020-05-13T17:00:00.000Z"
            },
            {
                "comment": "According to our experience while staying at this hotel are:\n* First, we felt that the hotel staff service was very friendly, because when we checked in we got a room on the 2nd floor where the room was quite dirty in our opinion. Then we tried contacting the receptionist to ask to move rooms and they helped support it by bringing a new room key to our room.\n* Second, we think the replacement room we got on the 4th floor is better than the previous room. But for cleanliness we feel it needs to be improved even more.\n* Third, it is unfortunate in the first room and our replacement room found a sign of burning on some furniture which apparently was caused by cigarette butts.\n* Fourth, hotel residents can enjoy breakfast at Upstrais Cafe with views of the city of Jakarta but the menu offered is ala carte on the menu but the choices are limited.\n\nYou can check our full review on YouTube Channel: SuddenEscape",
                "name": "MAYCEL",
                "source": "agoda",
                "reviewDate": "2020-07-04T17:00:00.000Z"
            },
            {
                "comment": "I was stay at their best room type, suite room but what i found is ripped curtain, no hot water, tv-remote control didn’t work properly so i need to turn it on and increase volume manually. ",
                "name": "Dita",
                "source": "agoda",
                "reviewDate": "2021-01-13T17:00:00.000Z"
            },
            {
                "comment": "Great location in center of Jakarta. Unfortunately, air con is not so cool, probably need maintenance.  You should avoid getting room on 4th floor since it shares floor with cafe which is noisy especially on weekend. ",
                "name": "Geral",
                "source": "agoda",
                "reviewDate": "2020-06-28T17:00:00.000Z"
            },
            {
                "comment": "Good room. Sooo clean. The bathroom is small but nice. The water take time to get warm but its nice afterall. The toiletries is full package, tower, toothbrush, soap, anything you need is there. I am lucky enough to get room that straight to the pool. Nice atmosphere. ",
                "name": "Sri",
                "source": "agoda",
                "reviewDate": "2020-10-03T17:00:00.000Z"
            }
        ],
        "reviewSummary": [
            "Good room",
            "Clean room",
            "Nice atmosphere",
            "Hotel staffs are friendly and helpful"
        ]
    }
]