[
    {
        "name": "Sheraton Bandung Hotel & Towers",
        "address": "JL. Ir H Juanda no.390, Bandung",
        "handleCovid": true,
        "city": "Bandung",
        "category": "hotel",
        "source": "tiket",
        "photos": [
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/rsfit00gsm/tix-hotel/images-web/2020/11/16/966bd687-4b48-4d4b-a6bd-10d926c06968-1605526958346-29b26e7018234e81f8b75166d8ff8f96.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/11/05/cdae5383-91c8-4112-aff6-7655d6b93684-1604584425269-d1fca4470a741bd7262a8aff3477cb2b.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/31/aa1552b8-ec4b-4302-b274-40ea040c0907-1604141373377-6417c922dfcee93ca76303c7c9b2a16e.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/rsfit00gsm/tix-hotel/images-web/2020/11/16/7ef44ef3-dc7e-4fb0-b624-1144eb7f278d-1605526990606-0d4a9796334d8bd09c7025be99cd6408.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/rsfit00gsm/tix-hotel/images-web/2020/11/16/93f39ecf-efc5-4f98-9ec3-c9fee0944d0d-1605527023701-4f3d796b8fbde1d00802fb64795e4a0b.jpg"
        ],
        "averageRating": 4.2,
        "ota": [
            {
                "price": 968000,
                "provider": "tiket",
                "link": "https://www.tiket.com/hotel/indonesia/sheraton-bandung-hotel-and-tower-108001534490501186"
            }
        ],
        "reviews": [
            {
                "comment": "Awalnya agak kecewa dengan tiket.com karena booking hotel pertama di jayakarta karena istri juga sudah booking disana. Namun d relokasi karena kamar penuh. Di relokasi dan upgrade hotel dari ★ 4 ke ★ 5. Agak repot sih harus pindah2 hotel karena tdk bisa having fun bareng dengan anak2 dan mertua. Direlokasi ke sheraton tanpa bayar biaya tambahan lg. Staff2 nya ramah, kamar bersih, kolam.renang bersih, makan juga enak. Next time pengen nginep bersama keluarga di.sheraton lagi. Terima kasih banyak ya Alloh atas berkahnya. Terima kasih Tiket.com semoga Alloh ganti dengan yang lebih besar. Semakin banyak peminatnya. ",
                "name": "puput utaminingsih",
                "source": "tiket",
                "reviewDate": "2019-12-30T09:02:17.790Z"
            },
            {
                "comment": "Hal yg paling berkesan staffnya disini ramah2 mulai dr housekeeping sampe staffnya, setiap papasan pasti kita selalu disapa dan senyum sumringah (bukan cuma senyum2 formalitas doang). Variasi untuk sarapannya juga lumayan banyak, rasanya juga enak2 & kita sekeluarga suka sama rawonnya. Enaakk! Kalo untuk kamarnya yaa so so lahh,mlh  agak dibawah ekspektasi kita, tp walaupun begitu kalau pagi & malem suasanannya enak kedengeran suara jangkrik & burung jd bikin relax.. btw itu kamarnya yg di towernya",
                "name": "RT",
                "source": "tiket",
                "reviewDate": "2019-06-10T07:22:53.175Z"
            },
            {
                "comment": "Breakfast is excellent and the service is great with friendly staff. My kids enjoy the fresh made juice. Our suggestion, provide more facilities for outdoor activities for kids. Also provide activity for younger kids during weekend",
                "name": "JONI",
                "source": "tiket",
                "reviewDate": "2019-10-13T07:27:34.987Z"
            },
            {
                "comment": "yg aku suka dr hotel ini late check out nya, krn anak saya sekolah online sampai jam 1 lewat kami di kasih cek out jam 2 pm.sayang playground nya tutup. karena tujuan nya nyenengin anak liburan keluarga. makanan lumayan banyaj variasi, untuk taste ok saja, tapi kamar nya kotor, di pintu kaca balcon ada noda merah tidak tau itu sarah atau cat, saya menginap 3 hari dan tetap saja tidak di bersihkan. semoga kebersihan nya di tingkatkan lagi.",
                "name": "YY",
                "source": "tiket",
                "reviewDate": "2020-10-21T08:38:50.837Z"
            },
            {
                "comment": "Stayed here for 2 nights.  Staff are friendly and helpful.  The room Tower Room was comfortable quite big, had nice backyard for sit and enjoying bandung’s air. for tower guest we have free access to tower lounge for enjoying afternoon coffe/tee and some snack. and the breakfast is also good.",
                "name": "Muhammad Nizar",
                "source": "tiket",
                "reviewDate": "2020-11-15T08:17:24.204Z"
            }
        ],
        "reviewSummary": [
            "Staf ramah yang menyapa dan tersenyum di sekitar tamu",
            "Kamar nyaman dan bersih clean",
            "Makanan dan minuman yang lezat",
            "Lokasi utama",
            "Kolam renang dan ruang kebugaran yang bagus"
        ]
    },
    {
        "name": "The Trans Luxury Bandung",
        "address": "Jl. Gatot Subroto No. 289, Batununggal, Cibangkong, Bandung, Kota Bandung, Jawa Barat 40273, Indonesia",
        "handleCovid": true,
        "city": "Bandung",
        "category": "hotel",
        "source": "tiket",
        "photos": [
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2021/01/18/945d1e6f-526b-4b75-8a20-d79aa0c2f7c4-1610946536945-74da6468773e16781ee392cfe055a4a6.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/15/2459b341-6e27-4d86-8d03-8cde52f1fa97-1602735059643-f96f1cf0eaf1ebf03e15a7e78bd25dbb.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/250d0016-bf94-4272-850e-35c65e35ed94-1603878951987-79756ed8ea5e8c094c678fe9152d9b23.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/6438d7a0-ec3f-4d64-a262-52e4ef486656-1603878951965-eeff060f6071deed457daf8d741989f9.jpg",
            "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/c60caeaa-197e-4ac7-a116-2ec4a2624751-1603878952606-e3889f36e3b2697fc7ed0b4df0f6b82d.jpg"
        ],
        "averageRating": 4.6,
        "ota": [
            {
                "price": 1495000,
                "provider": "tiket",
                "link": "https://www.tiket.com/hotel/indonesia/the-trans-luxury-bandung-108001534490290783"
            }
        ],
        "reviews": [
            {
                "comment": "Saat ini qualitas hotelnya menurun , pada saat check in tidak ada welcome fruits , tidak ada koran di pagi hari2 sehingga berbeda qualitas di tahun2 sebelumny ",
                "name": "HG",
                "source": "tiket",
                "reviewDate": "2020-01-01T10:21:13.270Z"
            },
            {
                "comment": "Kesan pertama menginap disini very fantastic. Dikasih surprise wedding anniv, kuenya enak bangeett. Staff ramah semua, pelayanannya juaraa.. Tengkyuu trans luxury.. will come back for sure!",
                "name": "YM",
                "source": "tiket",
                "reviewDate": "2020-08-30T08:22:49.959Z"
            },
            {
                "comment": "Kolam renang nya aduhai. Pelayanan Turn Down nya MUST TRY!  AC nya sopan semriwing.kamar luas, staff isi nya manusia semua, krn ada hotel 5 stars staff nya manusia tapi ngomong nya sistem, gak manusiawi. BERKESAN DEF WILL COME BACK !!",
                "name": "MF",
                "source": "tiket",
                "reviewDate": "2020-04-06T07:15:14.220Z"
            },
            {
                "comment": "Saya sangat senang menginap di trans luxury bandung, waktu check in saya mudah dan gampang, tempat check in pun sangat exclusive ada tempat duduk sofa yang sangat nyaman seperti kita kalau beli tiket bioskop yang premiere atau gold. pertama masuk kamar, kamar sudah di set dengan taburan bunga dan towel angsa serta ada cake yang cukup besar, padahal saya hanya request via tlp untuk anniversary dan ternyata di penuhi. memang mantul hotel ini, untuk sarapan juga banyak pilihan dan sangat enak. dan ketika berenang juga sangat bagus, karena ada kolam dengan pasir, sehingga anak2 bisa bermain pasri sambil main air. dan kolam renang anaknya pun hangat sehingga membuat anak2 betah. intinya sangat puas dengan pelayangan dan fasilitas disana, semoga ada rezeki untuk kembali disana mengambil tipe kamar yang paling bagus.",
                "name": "Herdanto Aryo Saputro",
                "source": "tiket",
                "reviewDate": "2020-02-18T03:09:15.651Z"
            },
            {
                "comment": "sejak covid 19, sdh 1thn lbh saya dan keluarga tidak pernah nginep2 lagi di hotel termasuk bandung, pertama x berani coba itu di tgl 2 april sd 4 april kmrn, coba 2 malam di trans, krna pas konfirmasi kamar nya, di fogging, UV dll sebelum tamu msk, dan hari ini aku sdh yg kedua kali di masa covid nginep krna merasa trans la yg protokol nya bener2 jaga mulai dr kebersihan dll, termasuk restoran, sayang di tgl 6 sd 17 mei ini tdk bs pergi liburan krna ada pembatasan mudik dr jakarta ke bandung, kalau boleh pasti nginep lagi minimal 2 mlm di sini, bagi temen2 lain yg pnya anak kecil trans luxury hotel la tempat yg paling cocok untuk nginep di luar fasilitas, kamar nya juga besar, tq",
                "name": "SB",
                "source": "tiket",
                "reviewDate": "2021-05-02T15:14:38.607Z"
            }
        ],
        "reviewSummary": [
            "Fasilitas bagus",
            "Kamar bersih dan nyaman",
            "Staf ramah yang menyapa dan tersenyum di sekitar tamu"
        ]
    }
]